app/controllers/api/v1/orders_controller.rb

    def index
        orders = Order.all
---
SELECT "orders".* FROM "orders"

    def show
        order = Order.find(params[:id])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]

    def create
        order = Order.create(user_params)
---
INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 37], ["created_at", "2020-04-15 23:07:25.932023"], ["updated_at", "2020-04-15 23:07:25.932023"]]